'use strict';
// -----------------------------------------------variables----------------------------------------- 
/* Завдання 1
Оголосіть дві змінні: admin та name.
Присвойте значення "Іван" змінній name.
Скопіюйте значення зі змінної name в admin.
Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).*/

let _admin, _name;
_name = 'Ivan';
_admin = _name;
console.log(`Your name is ${_admin}`);

/* Завдання 2
Створіть змінну із назвою нашої планети. Як би ви назвали таку змінну?
Створіть змінну для зберігання імені поточного відвідувача сайту. Як би ви назвали таку змінну?*/

let $planetEarth;
let _currentUser;
let _username = prompt("Enter your username", "");
console.log(`Entered name is ${_username}`);

// -----------------------------------------------operators----------------------------------------- 
/*Завдання 1
Які кінцеві значення всіх змінних a, b, c та d після виконання коду нижче? */
let aa = 1, b =1;
let c = ++aa; //2
let d = b++; //1
console.log (aa);
console.log(b);

// Виправте додавання 
let a = Number(prompt ("Перше число?", 1));
let f = Number (prompt ("Друге число?", 2));
console.log (a + f);